Revit 2027 API
MetallicPaint.MetallicpaintTopcoatGlossy Property
 The property labeled "Glossiness" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintTopcoatGlossy { get; }
Public Shared ReadOnly Property MetallicpaintTopcoatGlossy As String
	Get
public:
static property String^ MetallicpaintTopcoatGlossy {
	String^ get ();
}
static member MetallicpaintTopcoatGlossy : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace